{"id": "1c8c2916-7887-468c-bbcd-a0c6d8f46a16", "title": "Software Engineer", "description": "Key Responsibilities:\nDevelop high-quality software design and architecture.\n\nWrite clean, scalable, and efficient code in languages such as Java, Python, JavaScript, C++, or others.\n\nCollaborate with cross-functional teams to define, design, and ship new features.\n\nParticipate in code reviews and provide constructive feedback to peers.\n\nIdentify, troubleshoot, and debug software defects.\n\nStay current with emerging technologies and best practices in software development.\n\nContribute to all phases of the software development lifecycle (SDLC).\n\nMaintain documentation for software functionality and development processes.\n\nRequirements:\nBachelor’s degree in Computer Science, Software Engineering, or related field (or equivalent experience).\n\nProficiency in one or more programming languages.\n\nFamiliarity with version control systems (e.g., Git).\n\nExperience with databases, APIs, and cloud services is a plus.\n\nStrong problem-solving and communication skills.\n\nAbility to work independently and as part of a team.\n\nPreferred Skills (Optional):\nExperience with Agile or Scrum methodologies.\n\nKnowledge of DevOps practices and CI/CD pipelines.\n\nFamiliarity with front-end frameworks (React, Angular) or back-end frameworks (Node.js, Django).\n\nUnderstanding of security best practices.", "processed_text": "key responsibility develop high quality software design architecture write clean scalable efficient code language java python javascript c other collaborate cross functional team define design ship new feature participate code review provide constructive feedback peer identify troubleshoot debug software defect stay current emerge technology good practice software development contribute phase software development lifecycle sdlc maintain documentation software functionality development process requirement bachelor degree computer science software engineering related field equivalent experience proficiency one programming language familiarity version control system e g git experience database apis cloud service plus strong problem solve communication skill ability work independently part team prefer skill optional experience agile scrum methodology knowledge devops practice ci cd pipeline familiarity front end framework react angular back end framework node js django understanding security good practice", "skills": ["node.js", "ci/cd", "agile", "django", "git", "scrum", "angular", "react", "javascript", "python", "r", "java", "communication", "c++"]}